{"A study of teachers' use of online learning resources to design classroom activities.":"Department of Instructional Technology, Utah State University, Logan, UT, 84322, USA","Robustness and Security in a Mobile-Agent Based Network Monitoring System.":"Department of Computer Science University of Minnesota, Minneapolis MN 55455","The new BaBar Data Reconstruction Control System":"University of Colorado, Boulder, CO 80309, USA","Layering Boundary Protections: An Experiment in Information Assurance.":"The MITRE Corporation","Wireless Security: Vulnerabilities and Countermeasures.":"The MITRE Corporation","Three Applications of Formal Methods at MITRE.":"The MITRE Corporation USA USA","Information Flow in Nondeterministic Systems.":"The MITRE Corporation","Security Properties Consistent with the Testing Semantics for Communicating Processes.":"Mitre Corp., Bedford, MA","Stating Security Requirements with Tolerable Sets.":"MITRE Corporation, Burlington Road, Bedford, MA","NetBuilder: an environment for integrating tools and people.":"","Adjoining an Identity to a Reduced Archimedean f -ring, II: Algebras.":"5 W. Oak St. Ramsey NJ 07446 USA","The Drosophila Hrb87F gene encodes a new member of the A and B hnRNP protein group.":"Department of Biological Sciences, George Washington University, Washington, DC 20052, USA","Username mapping in a network.":"Computing Laborary, University of Salford, Salford M5 4WT, UK","Pole-zero analysis of speech by linear predictive coding.":"Dept. of Electrical & Electronic Engineering, University of Melbourne, Australia","EcoCyc: A comprehensive view of Escherichia coli biology.":"Department of Microbiology, Immunology, and Molecular Genetics and the Molecular Biology Institute, University of California, Los Angeles, CA 90095","The application of parallel processing to the simplified marker and cell method.":"Dept. of Civil & Mech. Eng., Southern Methodist Univ., Dallas, TX","On Batch Scheduling of Jobs with Stochastic Service Times and Cost Structures on a Single Server.":"Computer Science Department, The Pennsylvania State University,University Park, Pennsylvania 16802, USA","Adaptive spacetime method using Riemann jump conditions for coupled atomistic-continuum dynamics.":"University of Illinois at Urbana-Champaign, 1110 West Green Street, Urbana, Illinois 61801, USA","Multiobjective genetic algorithms for multiscaling excited state direct dynamics in photochemistry.":"Deptartment of Materials Science and Engineering","Sub-structural niching in estimation of distribution algorithms.":"Illinois Genetic Algorithms Laboratory University of Illinois at Urbana-Champaign 117 Transportation Building 104 S. Mathews Avenue Urbana, IL 61801","Sub-structural Niching in Estimation of Distribution Algorithms":"Illinois Genetic Algorithms Laboratory University of Illinois at Urbana-Champaign 117 Transportation Building 104 S. Mathews Avenue Urbana, IL 61801","Recycling Krylov Subspaces for Sequences of Linear Systems.":"Department of Materials Science, University of Illinois at Urbana-Champaign, Urbana, IL 61801","BladeCenter chassis management.":"International Business Machines Corporation","Use of demonstrations and experiments in teaching business statistics.":"Loughborough University, England","MuSIP multi-sensor image processing system.":"GEC-Marconi Research Centre, West Hanningfield Road, Gt. Baddow, Chelmsford CM2 8HN, UK","On the asymptotics of M-hypothesis Bayesian detection.":"Inst. of Comput. & Inf. Technol., Rice Univ., Houston, TX","Design, Manufacture and Test - Quality Test Estimation.":"","Development of Security Software: A High Assurance Methodology.":"National Security Agency","Cost Effective Software Engineering for Security.":"National Security Agency, STE 6511, 9800 Savage Road, Fort Meade, MD 20755-6511, USA","On the Complexity of Finding the Set of Candidate Keys for a Given Set of Functional Dependencies.":"","Statistical-Based Deformable Models with Simultaneous Optimization of Object Gray-Level and Shape Characteristics.":"Oak Ridge National Laboratory","ChemWindow, Version 2.11.":"Department of Chemistry and Biochemistry, Fayetteville, Arkansas 72701","Security and the Composition of Machines.":"","Game-Based Simulation for the Evaluation of Threat Detection in a Seaport Environment.":"School of Electrical Engineering and Computer Science Washington State University, Pullman, WA 99164","Enhancing physicality in touch interaction with programmable friction.":"Northwestern University Evanston, IL USA","Frictional widgets: enhancing touch interfaces with programmable friction.":"Northwestern University, Evanston, IL, USA","Using situational simulations to support decision making in co-dependent infrastructure systems.":"Michigan Technological University, 1400 Townsend Dr., Houghton, MI 49931, USA.","Integrated strategy of industrial product suppliers: Working with B2B intermediaries.":"School of Technology, Michigan Technological University, Houghton, Michigan, USA","Seizing the Moment: Harnessing the Information Technologies.":"The Rand Corporation, Santa Monica, CA, 90407-2138","Personality, motivation and video games.":"Queensland University of Technology, Brisbane","Exploring mindlessness as an explanation for the media equation: a study of stereotyping in computer tutorials.":"Creative Industries Faculty, Queensland University of Technology, Z2-202, KelvinGrove, Queensland 4059, Australia","The media equation and team formation: Further evidence for experience as a moderator.":"School of ITEE, University of Queensland, GPS Building (no. 78), St. Lucia, Queensland 4072, Australia","Effects of Team-Based Computer Interaction: The Media Equation and Game Design Considerations.":"Communication Design, Queensland University of Technology, Kelvin Grove, Queensland, 4059, Australia","Player-Centered Game Environments: Assessing Player Opinions, Experiences, and Issues.":"School of Information Technology and Electrical Engineering, University of Queensland, Australia","Experience as a moderator of the media equation: the impact of flattery and praise.":"School of ITEE, University of Queensland","Creating engaging artificial characters for games.":"","The inherent appeal of physically controlled peripherals.":"School of Information Technology and Electrical Engineering","Computer Games With Intelligence.":"School of Information Technology and Electrical Engineering University of Queensland","Getting off the GoldVarb Standard: Introducing Rbrul for Mixed-Effects Variable Rule Analysis.":"University of York","A Method for Global Optimization of Large Systems of Quadratic Constraints.":"Honeywell Laboratories","A New Method for the Global Solution of Large Systems of Continuous Constraints.":"Honeywell Laboratories 3660 Technology Drive Minneapolis, MN 55418 USA","Energy-efficient mechanisms for managing thread context in throughput processors.":"University of Illinois at Urbana-Champaign Urbana, IL","Cohesion: An Adaptive Hybrid Memory Model for Accelerators.":"University of Illinoisat Urbana-Champaign","GoldMine: Automatic assertion generation using data mining and static analysis.":"Electrical and Computer Engineering Department University of Illinois at Urbana Champaign","Cohesion: a hybrid memory model for accelerators.":"University of Illinois at Urbana-Champaign Urbana, IL 61801","A Task-Centric Memory Model for Scalable Accelerator Architectures.":"University of Illinois at Urbana-Champaign Urbana, IL 61801","Rigel: an architecture and scalable programming interface for a 1000-core accelerator.":"University of Illinois at Urbana-Champaign Urbana, IL 61801","Tradeoffs in designing accelerator architectures for visual computing.":"Center for Reliable and High-Performance Computing Department of Electrical and Computer Engineering University of Illinois at Urbana-Champaign","Preservice teachers' guide for learner-centered technology integration into instruction.":"Department of Curriculum and Instruction, Sam Houston State University, Huntsville, Texas, USA","The independent domination number of a random graph.":"","Data path issues in a highly concurrent machine.":"","Parallelizing computer system simulators.":"Univ. of Texas at Austin, Austin, TX","The FAST methodology for high-speed SoC/computer simulation.":"The University of Texas at Austin, 2Freescale Semiconductor, Inc.","FPGA-Accelerated Simulation Technologies (FAST): Fast, Full-System, Cycle-Accurate Simulators.":"The University of Texas at Austin","Dynamic reconfiguration for management of radiation-induced faults in FPGAs.":"Brigham Young University","Dynamic Reconfiguration for Management of Radiation-Induced Faults in FPGAs.":"Brigham Young University","The Reliability of FPGA Circuit Designs in the Presence of Radiation Induced Configuration Upsets.":"Brigham Young University","Third Party Application Forensics on Apple Mobile Devices.":"Rochester Institute of Technology","Network and systems security, a collaborative approach.":"Rochester Institute of Technology, Rochester, NY","A Re-examination of Network Address Translation Security.":"","Micropipelined asynchronous discrete cosine transform (DCT/IDCT) processor.":"Idax Inc., Norfolk, VA, USA","Asynchronous 2-D discrete cosine transform core processor.":"Dept. of Electr. & Comput. Eng., California Univ., Davis, CA, USA","Intel iAPX 432: VLSI building blocks for a fault-tolerant computer.":"Intel Corporation, Aloha, Oregon","Network architecture for joint failure recovery and traffic engineering.":"AT&T Labs Research Florham Park, NJ 07932","Scalable and Accurate Identification of AS-level Forwarding Paths.":"AT&T Labs-Research","Efficient and robust streaming provisioning in VPNs.":"AT&T Labs-Research","Disjoint-Path Facility Location: Theory and Practice.":"AT&T Labs - Research, 180 Park Avenue, Florham Park, NJ07932","Implementation Challenge for Shortest Paths.":"","Compressing rectilinear pictures and minimizing access control lists.":"AT&T Labs - Research, Room C239, 180 Park Avenue, Florham Park, NJ 07932","The NP-completeness column: Finding needles in haystacks.":"AT&T Labs { Research, Florham Park, New Jersey","The NP-completeness column: The many limits on approximation.":"AT&T Labs { Research, Florham Park, New Jersey","On the Sum-of-Squares algorithm for bin packing.":"AT&T Labs, Room C239, 180 Park Avenue, Florham Park, NJ 07932, USA.","The NP-completeness column.":"AT&T Labs { Research, Florham Park, New Jersey","On the Worst-case Performance of the Sum-of-Squares Algorithm for Bin Packing":"AT&T Labs - Research, Room C239, 180 Park Avenue, Florham Park, NJ 07932, USA","vLOD: High-Fidelity Walkthrough of Large Virtual Environments.":"AT&TLabs, 180 Park Ave., Florham Park, NJ 07932","Compressing Large Boolean Matrices using Reordering Techniques.":"AT&T Labs - Research","The Cutting-Stock Approach to Bin Packing: Theory and Experiments.":"AT&T Labs, Room C239, 180 Park Avenue, Florham Park, NJ 07932, USA","The geometric maximum traveling salesman problem.":"AT&T Research AT&T Labs Florham Park, NJ 07932-0971, USA","The Geometric Maximum Traveling Salesman Problem":"AT&T Research AT&T Labs Florham Park, NJ 07932-0971, USA","On the Sum-of-Squares Algorithm for Bin Packing":"AT&T Labs, Room C239, 180 Park Avenue, Florham Park, NJ 07932, USA.","The Asymmetric Traveling Salesman Problem: Algorithms, Instance Generators, and Tests.":"AT&T Labs, Room C239, 180 Park Avenue, Florham Park, NJ 07932, USA","Better approximation algorithms for bin covering.":"AT&T Labs, Room C239, 180 Park Avenue, Florham Park, NJ 07932, USA","Bounded Space On-Line Bin Packing: Best Is Better than First.":"AT&T Labs - Research, Florham Park, NJ 07932","The prize collecting Steiner tree problem: theory and practice.":"AT&T Labs, Room C239, 180 Park Avenue, Florham Park, NJ","On the sum-of-squares algorithm for bin packing.":"AT&T Labs, Room C239, 180","Bin Packing with Discrete Item Sizes, Part I: Perfect Packing Theorems and the Average Case Behavior of Optimal Packings.":"AT&T Labs - Research, Murray Hill, NJ 07974, USA","A Self Organizing Bin Packing Heuristic.":"AT&T Labs, Room C239, 180 Park Avenue, Florham Park, NJ 07932, USA","What are the Least Tractable Instances of max Tndependent Set?":"","The Maximum Traveling Salesman Problem Under Polyhedral Norms.":"AT&T Labs - Research, Room C239, Florham Park, NJ 07932-0971, USA","Near-optimal Intraprocedural Branch Alignment.":"AT&T Labs","Bin packing with discrete item sizes, part II: Tight bounds on First Fit.":"AT&T Labs, Murray Hill, New Jersey, 07974","Emerging opportunities for theoretical computer science.":"AT&T Research","Strategic directions in research in theory of computing.":"","Asymptotic Experimental Analysis for the Held-Karp Traveling Salesman Bound.":"Room 2D-150, AT&T Bell Laboratories, Murray Hill, NJ 07974","How to do experiments (extended advertisement).":"AT&T Research","A Brief History of SIGACT News and its Editors.":"AT&T Labs","Data Structures for Traveling Salesmen.":"Room 2D-150, AT&T Bell Laboratories, Murray Hill, NJ 07974","The Traveling Salesman Problem: A report on the State of the Art.":"","Minimizing Channel Density by Lateral Shifting of Components.":"Room 2D-150, AT&T Bell Laboratories, Murray Hill, NJ"}