{"Data Structures for Traveling Salesmen.":"Room 2D-150, AT&T Bell Laboratories, Murray Hill, NJ 07974","The Traveling Salesman Problem: A report on the State of the Art.":"","Minimizing Channel Density by Lateral Shifting of Components.":"Room 2D-150, AT&T Bell Laboratories, Murray Hill, NJ","The Complexity of Multiterminal Cuts.":"AT&T Bell Laboratories, Murray Hill, NJ 07974","Markov chains, computer proofs, and average-case analysis of best fit bin packing.":"","Deformable robot motion planning in a reduced-dimension configuration space.":"the School of Computing, University of Utah, USA","Graph search joint path planning for robot center of gravity positioning.":"Dept. of Mech. Eng., Univ. of Utah, Salt Lake City, UT","Towards a High Quality Path-Oriented Network Measurement and Storage System.":"University of Utah, School of Computing","Mobile Emulab: A Robotic Wireless and Sensor Network Testbed.":"University of Utah, School of Computing and Department of Mechanical Engineering","Robot couriers: precise mobility in a wireless network testbed.":"University of Utah","Emulab's wireless sensor net testbed: true mobility, location precision, and remote access.":"University of Utah","Algorithms for Interactive Editing of Level Set Models.":"University of Utah","Comparison of two routing metrics in OLSR on a grid based mesh network.":"Department of Electrical, Electronic and Computer Engineering, University of Pretoria Meraka Institute, CSIR Pretoria, South Africa","Comparison of MANET Routing Protocols Using a Scaled Indoor Wireless Grid.":"Computer Engineering at the University of Pretoria in South Africa","Building rural wireless networks: lessons learnt and future directions.":"Meraka Institute Council for Scienti?c and Industrial Research Pretoria, South Africa","A Platform for Supporting Micro-Collaborations in a Diverse Device Environment.":"University of Reading","Developing Collaborative Social Software.":"Advanced Computing and Emerging Technologies Centre, School of Systems Engineering, The University of Reading, Reading, RG6 6AY United Kingdom","A Peer-to-Peer Approach to Content Dissemination and Search in Collaborative Networks.":"Advanced Computing and Emerging Technologies Centre, School of Systems Engineering, The University of Reading, Reading, RG6 1AY United Kingdom","The E-Learning Grid: Peer-to-Peer Approach.":"","Supporting Ad Hoc Collaborations in Peer-to-Peer Networks.":"University of Reading","Bioinformatics process management: information flow via a computational journal.":"Information and Telecommunication Technology Center, University of Kansas, Lawrence, Kansas USA","An Algorithm to Use Feedback on Viewed Documents to Improve Web Query - Enabling Na├»ve Searchers to Search the Web Smartly.":"","An Algorithm to Use Feedback on Viewed Documents to Improve Web Query.":"School of Computing, Pvt Box 100, University of Tasmania, Hobart TAS 7001 Australia","More Effective Web Search Using Bigrams and Trigrams.":"School of Computing, Private Bag100, University of Tasmania, Hobart, Tasmania 7000, Australia","Synthesise Web Queries: Search the Web by Examples.":"School of Computing, Private Box 100, University of Tasmania, Hobart 7001 Australia","Automating Genomic Data Mining via a Sequence-based Matrix Format and Associative Rule Set.":"School of Computer Science, The University of Oklahoma, Norman, Oklahoma 73019","Association Implementation.":"","Enterprise Network Design: How Is it Done?":"","Text Chunking based on a Generalization of Winnow.":"T.J. Watson Research Center Route 134, Yorktown Heights, NY 10598, U.S.A.","Text Chunking using Regularized Winnow.":"IBM T.J. Watson Research Center Yorktown Heights New York, 10598, USA","Secure Access to Mission-Critical Applications.":"technologies ranging from traditional IBM SNA access products to leading-edge remote access and Internet technology","A decision-tree-based symbolic rule induction system for text categorization.":"IBM System Journal","NL Understanding with a Grammar of Constructions":"IBM Research Division T.J . Watson Research Lab Yorktown Heights , NY 10598 USA","Dynamic Interpretations of Constraint-Based Grammar Formalisms.":"Mathematical Sciences Department, Thomas J. Watson Research Center, IBM ResearchDivision, Yorktown Heights, NY 10598 USA","NL Understanding with a Grammar of Constructions.":"IBM Research Division T . J . Watson Research Lab Yorktown Heights N Y 10598 USA","A Unification-Based Parser for Relational Grammar.":"IBM Research Division P.O. Box 218 Yorktown Heights NY 10598","Some Formal Properties of Stratified Feature Grammars.":"IBM Research Division Mathematical Sciences Department P.O. Box 218 10598 Yorktown Heights NY USA P.O. Box 218 10598 Yorktown Heights NY USA","Relational-grammar-based generation in the JETS Japanese-English machine translation system.":"IBM Research, T. J. Watson Research Laboratory P.O. B o x 2 1 8 Yorktown Heights, NY 10598 USA","Spert-II: A Vector Microprocessor System.":"International Computer","SPERT-II: A Vector Microprocessor System and its Application to Large Problems in Backpropagation Training.":"International Computer Science Institute, 1947 Center Street, Suite 600, Berkeley CA 94704-1105","An impedance model for blood flow in the human arterial system. Part I: Model development and MATLAB implementation.":"Department of Chemical Engineering, University of Delaware, Newark, DE 19716, USA Delaware Biotechnology Institute, University of Delaware, Newark, DE 19716, USA","Development and implementation of a team of robotic tractors for autonomous peat moss harvesting.":"Commercial and Consumer Equipment Division John Deere Charlotte, North Carolina 28273","PW-MAC: An energy-efficient predictive-wakeup MAC protocol for wireless sensor networks.":"Department of Computer Science, Rice University, Houston, TX, USA","EMAC: An Asynchronous Routing-Enhanced MAC Protocol in Multi-Hop Wireless Networks.":"","ADB: an efficient multihop broadcast protocol based on asynchronous duty-cycling in wireless sensor networks.":"Rice University Houston, TX, USA","Distributed Computing in Sensor Systems, 4th IEEE International Conference, DCOSS 2008, Santorini Island, Greece, June 11-14, 2008, Proceedings":"Rice University Department of Computer Science, Houston, TX 77005-1992, USA","DW-MAC: a low latency, energy efficient demand-wakeup MAC protocol for wireless sensor networks.":"Department of Computer Science, Rice University, Houston, TX, US","RI-MAC: a receiver-initiated asynchronous duty cycle mac protocol for dynamic traffic loads in wireless sensor networks.":"Department of Computer Science, Rice University, Houston, TX, USA","Safari: A self-organizing, hierarchical architecture for scalable ad hoc networking.":"Rice University, Department of Computer Science, 6100 Main Street, MS 132, Houston, TX 77005-1892, USA","Mobile Ad-Hoc and Sensor Networks, Third International Conference, MSN 2007, Beijing, China, December 12-14, 2007, Proceedings":"Rice University, Department of Computer Science, Houston, TX 77005-1892, USA","An Adaptive Scheduling Protocol for Multi-scale Sensor Network Architecture.":"Department of Computer Science, Rice University, Houston, TX","RMAC: A Routing-Enhanced Duty-Cycle MAC Protocol for Wireless Sensor Networks.":"Department of Computer Science, Rice University, Houston, TX, USA","Design and Performance of PRAN: A System for Physical Implementation of Ad Hoc Network Routing Protocols.":"Department of Computer Science, Rice University, 6100 Main St. MS-132,Houston, TX 77005-1892","An architecture for distributed wavelet analysis and processing in sensor networks.":"Dept. of Computer Science Rice University Houston, Texas","Routing characteristics of ad hoc networks with unidirectional links.":"Computer Science Department, Rice University, Houston, TX 77005, United States","Wormhole attacks in wireless networks.":"Department of Computer Science, Rice University, Houston, TX 77005-1892 USA","Design of Adaptive Overlays for Multi-scale Communication in Sensor Networks.":"Rice University, Department of Computer Science, Houston, TX 77005-1892","Ad hoc networking: past, present, and future.":"Rice University","SIGMOBILE FY'05 annual report: July 2004-June 2005.":"Department of Computer Science, Rice University, Houston, Texas, USA","Ariadne: A Secure On-Demand Routing Protocol for Ad Hoc Networks.":"Rice University, USA","Exploiting Congestion Information in Network and Higher Layer Protocols in Multihop Wireless Ad Hoc Networks.":"Rice University","TreeCast: A Stateless Addressing and Routing Architecture for Sensor Networks.":"Department of Computer Science Rice University,Houston, TX-77005","Adaptive clock synchronization in sensor networks.":"Rice University, Houston, TX","Multihop Wireless Ad Hoc Networking: Current Challenges and Future Opportunities.":"Department of Computer Science Rice University","Securing quality-of-service route discovery in on-demand routing for ad hoc networks.":"Rice University","Modeling mobility for vehicular ad-hoc networks.":"Deparment of Computer Science Rice University MS­132, 6100 Main Street Houston, TX, USA","Packet Leashes: A Defense against Wormhole Attacks in Wireless Networks.":"Rice University Department of Computer Science","Efficient Security Mechanisms for Routing Protocolsa.":"Rice University","Design and Evaluation of a Metropolitan Area Multitier Wireless Ad Hoc Network Architecture.":"Rice University","Rushing attacks and defense in wireless ad hoc network routing protocols.":"Rice University","SEAD: secure efficient distance vector routing for mobile wireless ad hoc networks.":"Rice University, Houston, TX 77005, USA","Power Mode Scheduling for Ad Hoc Networks.":"Rice University Department of Computer Science","Ariadne: a secure on-demand routing protocol for ad hoc networks.":"Rice University, USA","Ensuring cache freshness in on-demand ad hoc network routing protocols.":"Rice University Houston, TX, USA","SEAD: Secure Efficient Distance Vector Routing for Mobile Wireless Ad Hoc Networks.":"Rice University, Houston, TX 77005, USA","A survey of rollback-recovery protocols in message-passing systems.":"Rice University","openSourcePACS: An Extensible Infrastructure for Medical Image Management.":"E! Networks, Los Angeles, CA 90036","Proceedings of the Third International Workshop on Vehicular Ad Hoc Networks, VANET 2006, Los Angeles, CA, USA, September 29, 2007":"","Proceedings of the Second International Workshop on Vehicular Ad Hoc Networks, VANET 2005, Cologne, Germany, September 2, 2005":"","Proceedings of the Ninth Annual International Conference on Mobile Computing and Networking, MOBICOM 2003, 2003, San Diego, CA, USA, September 14-19, 2003":"","Handling Uncertainty in the Development and Design of Chemical Processes.":"Dept of Chemical Engineering, University College London,Torrington Place, London, U.K. WC1E 7JE","A Pattern Decomposition Algorithm for Data Mining of Frequent Patterns.":"Computer Science Department University of California - Los Angeles","Information and Communications Technologies in School Mathematics, IFIP TC3/WG3.1 Working Conference on Secondary School Mathematics in the World of Communication Technology: Learning, Teching, and the Curriculum, 26-31 October 1997, Grenoble, France":"","ICT's and secondary school mathematics - themes, visions and realities.":"","Informatics and Changes in Learning, Proceedings of the IFIP TC3/WG3.1/WG3.5 Open Conference on Informatics and Changes in Learning, Gmunden, Austria, 7-11 June, 1993":"","Cognitive development and classroom interaction: a theoretical foundation for teaching and learning.":"School of Education, King's College, University of London, United Kingdom","Edge sharpness perception with force and contact location information.":"Geometric Design and Computation Laboratory, University of Utah, Salt Lake City, UT, USA","Critical point analysis using domain lifting for fast geometry queries.":"School of Computing, University of Utah, USA","Computing surface offsets and bisectors using a sampled constraint solver.":"University of Utah","A higher dimensional formulation for robust and interactive distance queries.":"School of Computing, University of Utah","Distance extrema for spline models using tangent cones.":"School of Computing University of Utah","Six Degree-of-Freedom Haptic Rendering Using Spatialized Normal Cone Search.":"School of Computing, University of Utah","Accelerated Haptic Rendering of Polygonal Models through Local Descent.":"School of Computing,University of Utah","Height Field Haptics.":"School of Computing, University of Utah","Six Degree-of-Freedom Haptic Rendering of Complex Polygonal Model.":"","Spatialized normal come hierarchies.":"School of Computing, University of Utah","Bound Coherence for Minimum Distance Computations.":"Department of Computer Science University of Utah Salt Lake City, Utah 84112","Painting Textures with a Haptic Interface.":"Department of Computer Science, University of Utah","A Framework for Efficient Minimum Distance Computations.":"Department of Computer Science,University of Utah,Salt Lake City, UT 84112","Haptic Manipulation of Virtual Mechanisms from Mechanical CAD Designs.":"Depts. Computer Science and Mechanical Engineering, Univ. Utah, Salt Lake City, UT 84112","Direct Haptic Rendering of Sculptured Models.":"Department of Computer Science University of Utah","The Design of Post-Analysis in the Jets Japanese/English Machine Translation System.":"","SGCEdb: a flexible database and web interface integrating experimental results and analysis for structural genomics focusing on Caenorhabditis elegans.":"Center for Biophysical Sciences and Engineering, University of Alabama at Birmingham Birmingham, AL, USA","Emergent behavior in two complex cellular automata rule sets.":"Department of Computer Science, Valparaiso University, Valparaiso, Indiana 46383","Teaching theory of computation using pen-based computers and an electronic whiteboard.":"Computer Science Department, DePauw University, Greencastle, IN","The design of an interface for student note annotation in a networked electronic classroom.":"Computer Science Department, DePauw University, Greencastle, IN 46135, USA","Knowledge Mining With VxInsight: Discovery Through Interaction.":"Sandia National Laboratories, Albuquerque, NM","Traffic characterization and internet usage in rural Africa.":"University of California, Santa Barbara","Gateway-aware routing for wireless mesh networks.":"Department of Computer Science University of California - Santa Barbara","Impacts of Positional Error on Spatial Regression Analysis: A Case Study of Address Locations in Syracuse, New York.":"SUNY College of Environmental Science and Forestry","A Novel Efficient Algorithm for Locating and Tracking Object Parts in Low Resolution Videos.":"Computer Science Electrical Engineering, University of Missouri - Kansas City, 5110 Rockhill Road, Kansas City, MO, 64110, USA","Human Robot Interaction Through Semantic Integration of Multiple Modalities, Dialog Management, and Contexts.":"Electrical Engineering and Computer Science and the Graduate Faculty of the University of Kansas","Law and Borders: The Rise of Law in Cyberspace.":"Cyperspace Law Institute","The Great Debate - Law in the Virtual World.":"Cyberlaw","The Life of the Law Online.":"New York Law School","The New 'Civic Virtue' of the Internet.":"Co-Director, Cyberspace Law Institute","Law and Borders - The rise of law in Cyberspace.":"Co-Director, Cyberspace Law Institute","Due Process and Cyberjurisdiction.":"Cyberspace Law Insitute","Bin Packing.":"","Special issue on computational methods for graph coloring and its generalizations.":"","Proceedings of the 39th Annual ACM Symposium on Theory of Computing, San Diego, California, USA, June 11-13, 2007":"","What is the science in experimental computer science?":"","Computer Security Risks in the Internet Era: Are Small Business Owners Aware and Proactive?.":"Utah Valley State","Improving Computer Literacy of Business Management Majors: A Case Study.":"Utah Valley State College, Orem, Utah, USA","The development facility approach to improved software development.":"The Upjohn Company, Kalamazoo, Michigan","Detecting Application Load Imbalance on High End Massively Parallel Systems.":"Cray Inc., Mendota Heights, MN USA","Computing ethics: Computer experts: guns-for-hire or professionals?":"University of Virginia, Charlottesville, VA","Computer Professional Ethics in Theory and in Practice.":"University of Virginia, USA","A dialogue on responsibility, moral agency, and IT systems.":"Anne Shirley Carter Olson Professor of Applied Ethics University of Virginia Charlottesville, Virginia, USA1-434-924-7751","Is diversity in computing a moral matter?":"School of Engineering and Applied Science, University of Virginia, Charlottesville, Virginia 22904-4744 USA","Anonymity, pseudonymity, or inescapable identity on the net (abstract).":"Rensselaer Polytechnic Institute","Ethical Issues for Computer Scientists and Engineers.":"","Data Retention and the Panoptic Society: The Social Benefits of Forgetfulness.":"School of Public Policy Georgia Institute of Technology","Cryptography, data retention, and the panopticon society (abstract).":"Rensselaer Polytechnic Institute","Ethics Online: Shaping Social Behavior Online Takes More THan New Laws and Modified Edicts.":"","Democracy and the Global Information Infrastructure.":"","Using the New ACM Code of Ethics in Decision Making.":"","Accountability and Computer Decision Systems.":"Department of Science and Technology Studies at Rennselaer Polytechnic Institute","Methods of integrating the study of ethics into the computer science curriculum (panel session).":"Department of Science and Technology Studies, Rensselaer Polytechnic Institute, Troy, New York","The gene encoding topoisomerase II from Plasmodium falciparum.":"Institute of Cell and Molecular Biology, University of Edinburgh, King's Buildings, Mayfield Road,Edinburgh EH9 3JR, UK","Distance perception in virtual environments.":"Rhodes College","Genetic Programming in Wireless Sensor Networks.":"Rochester Institute of Technology, Rochester NY 14623, USA","UNIX Host Administration in a Hererogeneous Distributed Computing Environment.":"","Focus on the Library Customer: Revelation, Revolution, or Redundancy?.":"Univ. Missouri-Columbia, school library information sci., Columbia MO 65211, ETATS-UNIS","The Purposeful Integration of an Academic Electronic Health Record across Nursing Curricula.":"","Computer Installation Accounting.":"","The Elliptic Curve Digital Signature Algorithm (ECDSA).":"Certicom Research, Canada CA","Key Agreement Protocols and Their Security Analysis.":"Certicom Corp. 200 Matheson Blvd West L5R 3L7 Mississauga Ontario Canada 200 Matheson Blvd West L5R 3L7 Mississauga Ontario Canada","Whole-painting canvas analysis using high- and low-level features.":"Elec. & Comp. Engineering, Rice University, USA","Matching canvas weave patterns from processing x-ray images of master paintings.":"Elec. & Comp. Engineering Rice University","Recovering Spikes from Noisy Neuronal Calcium Signals via Structured Sparse Approximation.":"Dept. of Electrical and Computer Engineering, Rice University, Houston, TX 77005, USA","Information theory and neural information processing.":"Dept. of Electr. & Comput. Eng., Rice Univ., Houston, TX, USA","Statistical Signal Processing in Neuroscience.":"Department of Electrical and Computer Engineering, Rice University, TX 77005-1892, USA","Reconstruction of compressively sensed images via neurally plausible local competitive algorithms.":"Dept. of Electr. & Comput. Eng., Rice Univ., Houston, TX","Information theoretic bounds on neural prosthesis effectiveness: The importance of spike sorting.":"Department of Electrical and Computer Engineering Rice University, Houston, TX 77251-1892","Distributed Structures, Sequential Optimization, and Quantization for Detection.":"Department of Electrical and Computer Engineering, Rice University, Houston,TX 77251-1892 USA","Sparse Coding via Thresholding and Local Competition in Neural Circuits.":"","Joint Optimization of Distributed Broadcast Quantization Systems for Classification.":"Department of Electrical and Computer Engineering Rice University, Houston, TX 77251-1892","Fundamental Detection and Estimation Limits in Spike Sorting.":"Elec. & Comp. Engineering Dept. MS-366 Rice University Houston TX 77005-1892","Locally Competitive Algorithms for Sparse Approximation.":"Electrical & Computer Engineering Department Rice University","Power scheduling for wireless sensor and actuator networks.":"Rice University Houston, Texas 772511892","Toward a theory of information processing.":"Computer and Information Technology Institute, Department of Electrical and ComputerEngineering, MS 380, Rice University, 6100 Main Street, Houston, Texas 77005-1892","Evaluating Local Contributions to Global Performance in Wireless Sensor and Actuator Networks.":"Department of Electrical and Computer EngineeringRice University, Houston, TX 77025-1892","Analyzing the robustness of redundant population codes in sensory and feature extraction systems.":"Department of Electrical & Computer Engineering, Rice University, Houston, TX, 77251","Signal-to-noise ratio.":"","Examining methods for estimating mutual information in spiking neural systems.":"Department of Electrical & Computer Engineering Rice University, Houston, TX, 77251","Measuring information transfer in the spike generator of crayfish sustaining fibers.":"Department of Electrical & Computer Engineering, Rice University, Houston, TX, 77251","Neural Population Structures and Consequences for Neural Coding.":"Department of Electrical & Computer Engineering, MS 366, Rice University, 6100 Main Street, Houston, Texas, TX 77251-1892, USA","Optimal Stimulus Coding by Neural Populations Using Rate Codes.":"Department of Electrical & Computer Engineering, MS 366Rice University 6100 Main Street Houston, Texas 77251-1892","When does interval coding occur?":"Department of Electrical & Computer Engineering,MS 366 Rice University6100 Main Street Houston, Texas 77251-1892","Visual Responses of Crayfish Ocular Motoneurons: An Information Theoretical Analysis.":"Department of Electrical and Computer Engineering, Rice University, Houston, TX 77005, USA","Information processing during transient responses in the crayfish visual system.":"Department of Electrical & Computer Engineering Rice University, Houston, TX 77251-1892","Visual Signals in an Optomotor Reflex: Systems and Information Theoretic Analysis.":"Rice University","Information-Theoretic Analysis of Neural Coding.":"Department of Electrical and Computer Engineering Department of Statistics Rice University, MS 366, Houston, Texas 77005-1892","Comparison of optimal and suboptimal spike sorting algorithms to theoretical limits.":"Department of Electrical and Computer Engineering, Rice University, Houston, TX, USA","Quantifying information transfer in spike generation.":"Department of Electrical & Computer Engineering, Rice University, 6100 Main Street, P.O. Box 1892, Houston, TX 77251, USA","Correlation and neural information coding fidelity and efficiency.":"Rice University, Houston, TX, USA","A nonstationary Poisson point process describes the sequence of action potentials over long time scales in lateral-superior-olive auditory neurons.":"Rice University Department of Electrical and Computer Engineering 77251 Houston TX USA 77251 Houston TX USA","An Operator Interface for Teleprogramming Employing Synthetic Fixtures.":"","RT PC Distributed Services Overview.":"IBM Industry Systems Products, Austin, Texas","Verification, validation, and accreditation (VV&A): one voice --- unified, common & cross-cutting.":"Engineer Systems Solutions","Circulating shared-registers for multiprocessor systems.":"CS Department, Azusa Pacific University, Azusa, CA 91702, United States","Low-Cost, High-Performance Barrier Synchronization on Networks of Workstations.":"Department of Computer Science, University of Minnesota, Minneapolis, Minnesota 55455","A Circulating Active Barrier Synchronization Mechanism.":"","A Distributed Hardware Mechanism for Process Synchronization on Shared-Bus Multiprocessors.":"University of Minnesota, USA","Testbed Evaluation of Virtual Environment Interaction Techniques.":"Graphics, Visualization, and Usability Center Georgia Institute of Technology Atlanta, GA 30332-0280 USA(404) 894-8787","Testbed evaluation of virtual environment interaction techniques.":"Graphics, Visualization, and Usability Center Georgia Institute of Technology Atlanta, GA 30332-0280 USA(404) 894-8787","Connected Components in O (log^3/2 n) Parallel Time for the CREW PRAM.":"","Minimizing Access Costs in Replicated Distributed Syste (Abstract).":"","Optimal Algorithms for the Single and Multiple Vertex Updating Problems of a Minimum Spanning Tree.":"Dartmouth College","Toward Multimedia Conference Proceedings.":"Dartmouth College","Deterministic Leader Election on the Asynchronous QRQW PRAM.":"","A Parallel Algorithm for Computing Minimum Spanning Trees.":"Dartmouth College","A Tight Upper Bound on the Benefits of Replica Control Protocols.":"Dartmouth Coll, Dept Math & Comp Sci, Hanover, NH 03755, USA and Transare Corp, Pittsburgh, PA 15219, USA","Complexity of Network Reliability and Optimal Resource Placement Problems.":"","Optimal Algorithms for the Vertex Updating Problem of a Minimum Spanning Tree.":"Dartmouth College","Connected Components in O(\\lg^3/2 |V|) Parallel Time for the CREW PRAM":"","Finding Optimal Quorum Assignments for Distributed Databases.":"Dartmouth College","A Tight Upper Bound on the Benefits of Replication and Consistency Control Protocols.":"Dartmouth College","Effects of Replication on Data Availability.":"Dartmouth College","Erratum: Generalized Selection and Ranking: Sorted Matrices.":"","Parallel algorithms for minimum cuts and maximum flows in planar networks.":"Dartmouth College, Hanover, NH","A Simple Proof of a Time-Space Trade-Off for Sorting with Linear Comparisons.":"","An O(n log2 n) Algorithm for Maximum Flow in Undirected Planar Networks.":"","Generalized Selection and Ranking: Sorted Matrices.":"","Partition of Planar Flow Networks (Preliminary Version)":"","Finding k-th Paths and p-Centers by Generating and Searching Good Data Structures.":"Computer Science Department, The Pennsylvania State University, University Park, Pennsylvania 16802, USA","Parallel Algorithms for Minimum Cuts and Maximum Flows in Planar Networks (Preliminary Version)":"","Sorting Numbers in Linear Expected Time and Optimal Extra Space.":"","The Complexity of Selection and Ranking in X+Y and Matrices with Sorted Columns.":"","A Priority Queue in Which Initialization and Queue Operations Take O(log log D) Time.":"","Generating and Searching Sets Induced by Networks.":"The Pennsylvania State University Computer Science Department 16802 University Park Pennsylvania USA 16802 University Park Pennsylvania USA","Generalized Selection and Ranking (Preliminary Version)":"","A New Algorithm for Preemptive Scheduling of Trees.":"The Pennsylvania State University, University Park, Pennsylvania","Reducibility Among Floating-Point Graphs.":"Computer Science Department, The Pennsylvania State University, University Park, PA","Lower Bounds for Selection in X+Y and Other Multisets.":"","Selecting the Kth element in X + Y and X_1 + X_2 + ... + X_m.":"","Efficient Algorithms for Shortest Paths in Sparse Networks.":"T h e   P e n n s y l v a n i a   Stat e   Un i v e r s i t y ,   Un i v e r s i t y   P a r k ,   P e n n s y l v a n i a","Priority Queues with Update and Finding Minimum Spanning Trees.":"","Finding All the Elementary Circuits of a Directed Graph.":"Computer Science Department, Pennsylvania State University, University Park, Pennsylvania 16802.","A Note on Dijkstra's Shortest Path Algorithm.":"Department of Computer Science, Cornell University, Ithaca, New York","Formal Security Proofs for a Signature Scheme with Partial Message Recovery.":"Certicom Research Canada"}