{"Selecting the Kth element in X + Y and X_1 + X_2 + ... + X_m.":"","Efficient Algorithms for Shortest Paths in Sparse Networks.":"The Pennsylvania State University, University Park, Pennsylvania","Priority Queues with Update and Finding Minimum Spanning Trees.":"","Finding All the Elementary Circuits of a Directed Graph.":"Computer Science Department, Pennsylvania State University, University Park, Pennsylvania16802.","A Note on Dijkstra's Shortest Path Algorithm.":"Department of Computer Science, Cornell University, Ithaca, New York","Formal Security Proofs for a Signature Scheme with Partial Message Recovery.":"Certicom Research Canada","AES and Future Resiliency: More Thoughts and Questions.":"","A proposed mode for triple-DES encryption.":"IBM Research Division, Thomas J. Watson Research Center, P.O. Box 218, Yorktown Heights, New York 10598, USA","The Commercial Data Masking Facility (CDMF) data privacy algorithm.":"IBM Federal Systems Company, 9500 Godwin Drive, Manassas, Virginia 22110, USA","Design of the Commercial Data Masking Facility Data Privacy Algorithm.":"IBM Cryptography Center of Competence, IBM Federal Systems Company, 9500 Godwin Drive, Building 400/046, Manassas, VA","A Public Key Extension to the Common Cryptographic Architecture.":"","Common Cryptographic Architecture Cryptographic Application Programming Interface.":"IBM Federal Sector Division, 9500 Godwin Drive, Manassas, Virginia 22110, USA","Transaction Security System Extensions to the Common Cryptographic Architecture.":"Johnson IBM Federal Sector Division, 9500 Godwin Drive, Manassas, Virginia 22110, USA","A scalability study of web-native information visualization.":"Mississippi State University","Applying CMM Project Planning Practices to Diverse Environments.":"LOGOS Int., Boston, MA","A Software Process Improvement Approach Tailored for Small Organizations and Small Projects (Tutorial).":"LOGOS International, Inc., 8 Mackintosh Lane, Lincoln, MA","Realities and Rewards of Software Process Improvement.":"","Return on Investment (ROI) from Software Process Improvement as Measured by US Industry.":"","What Small Business and Small Organizations Say About the CMM: Experience Report.":"LOGOS International, Inc., 185 Tudor RD, Needham, MA 02192 & 8 Mackintosh LN, Lincoln, MA","Highly Scalable Virtual Metadata Catalogues - A Case Study.":"","Neural Network Based Model Predictive Control.":"","Database Layout Guidelines for Large Queries.":"","Terrier Information Retrieval Platform.":"University of Glasgow, Glasgow G12 8QQ, UK","Identifying, Correcting, and Avoiding Errors in Computer-Aided Design Models Which Affect Interoperability.":"CoCreate Software Inc., 3801 Automation Way, Suite 110, Fort Collins, CO 80525","Managing Object Oriented Projects - Panel Session.":"","Object-oriented project management (panel).":"Rothwell International","The Case for a Read Barrier.":"","Trap Architectures for Lisp Systems.":"Texas Instruments MS 238, P.O. Box 655474, Dallas, Texas 75265","Requesting Routing Architecture in Content Delivery Networks.":"","Nanoscale Atomic Clusters, Complexity of.":"","Tools for Enhancing Distributed, Asynchronous Collaboration in Army Operations.":"Ind. & Syst. Eng., Ohio State Univ., Columbus, OH, USA"}